import React from 'react';

const AboutService = () => {
    const handleScrollToTop = () => {
        window.scrollTo({
            top: 0,
            behavior: "smooth"
        });
    };
    return (
        <div>
            <div className={"AboutUsService"}></div>
            <div className={"aboutUsMain"}>Про нас</div>
            <div className={"aboutUsSub1"}>ЩО ТАКЕ ВОЛОНТЕРСЬКА ПЛАТФОРМА?</div>
            <div className={"aboutUsSub2"}>ДЛЯ КОГО СТВОРЕНА ПЛАТФОРМА?</div>
            <div className={"aboutUsSub3"}>ХТО СТВОРИВ ПРОЕКТ?</div>
            <div className={"aboutUsSub4"}>ХОЧЕШ ВОЛОНТЕРИТИ?</div>
            <div className={"sub1Text"}>Волонтерство — це добровільна безоплатна суспільно корисна діяльність, спрямована на вирішення або пом’якшення соціальних проблем. Волонтери вкладають свій час, зусилля й талант для того, аби зробити світ кращим.<br/><br/>

                Волонтерська Платформа — це онлайн-портал, який збирає можливості волонтерства з усієї України та допомагає однодумцям знайти одне одного. Платформа дає змогу волонтерам знайти можливості творити добро, розвиватись та змінювати світ, а неприбутковим організаціям дарує шанс знайти надійних волонтерів для спільної роботи й налагоджує комунікацію між ними.</div>
            <div className={"sub2Text"}>Якщо ти лише відкриваєш для себе світ волонтерства, Платформа стане компасом для пошуку можливостей та допоможе обрати волонтерство до душі. Тут ти можеш <a href={"/associations"}><b><u>познайомитись з громадськими та благодійними організаціями</u></b></a>, дізнатись про різні сфери волонтерської допомоги й подати заявку на проєкти, які тебе цікавлять. <br/><br/>

                Якщо ти досвідчений волонтер, Платформа збільшить твій волонтерський стаж у цій сфері. Ти зможеш знайти можливості в міжнародних організаціях, познайомитись із новими напрямами та урізноманітнити свою волонтерську діяльність.<br/><br/>

                Якщо ти шукаєш волонтерів для власного проєкту чи організації, Платформа допоможе знайти надійних та відповідальних людей, які поділятимуть твої цінності. Ти можеш зареєструвати як велику громадську чи благодійну організацію, так і локальний проєкт, волонтерську групу чи ініціативу й розповісти про вашу діяльність на власній сторінці. Якщо тобі потрібна допомога волонтерів, створюй власну можливість та знаходь помічників для змін у світі.</div>
            <div className={"sub3Text"}>Платформа розроблена студентом Чернівецького національного університету <b>Нетребіном Артуром Антоновичем</b> як результат дипломної роботи за 2024 рік.</div>
            <img className={"ArthurPhoto"} src={"/images/photo_2024-06-07_12-49-00.jpg"} alt={"Arthur"}/>
            <div className={"subTelephone"}>+380987321877</div>
            <div className={"subEmail"}>artur.netrebin@gmail.com</div>

            <div className={"sub4Text"}>1. Для того, щоб почати шукати заходи тобі потрібно <a href={"/register"}><b><u>зареєструватись</u></b></a> на платформі.<br/>
                2. Шукай актуальні пропозиції волонтерства в розділі <a href={"/all-events"}><b><u>"Заходи"</u></b></a>.<br/>
                3. За потреби, можеш скористатись фільтром та обрати потрібне місто чи сферу волонтерства.<br/>
                4. Ознайомся з описом можливості та форматом проведення заходу, а також переконайся, що дедлайн подачі заявок ще не минув. Якщо ти хочеш долучитись до певного заходу — натискай «Долучитись».<br/>
                5. Приємного волонтерства! Не забудь розповісти іншим про свій досвід після старту заходу та поставити свою оцінку!<br/><br/>

                Також ти можеш долучитись до волонтерських спілок чи очолити свою в розділі <a href={"/associations"}><b><u>"Спілки"</u></b></a>.<br/>
                Якщо ж ти хочеш створити свій захід, то ти повинен бути засновником організації.
            </div>
            <div className={"lastSub"}>Ми завжди охоче приймаємо зворотний зв'язок. Якщо у тебе є поради чи пропозиції, пиши на пошту volunteerhub@gmail.com й ми неодмінно відреагуємо на твій коментар.<br/><br/>

                Приємного волонтерства! 💛</div>
            <img onClick={handleScrollToTop} className="arrowSub" src="/images/arrow1.png" alt="arrow" />
        </div>
    );
};

export default AboutService;